rodrigo-s-lange/esp32libfun/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# esp32libfun default configuration
CONFIG_IDF_TARGET_ESP32S3=y

# Serial console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Flash settings
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# esp32libfun modules
CONFIG_ESP32LIBFUN_SERIAL=y
CONFIG_ESP32LIBFUN_AT=y
CONFIG_ESP32LIBFUN_AT_MAX_CMDS=48
CONFIG_ESP32LIBFUN_DELAY=y
CONFIG_ESP32LIBFUN_GPIO=y
CONFIG_ESP32LIBFUN_LEDC=y
CONFIG_ESP32LIBFUN_I2C=n
CONFIG_ESP32LIBFUN_PCNT=y
CONFIG_ESP32LIBFUN_SPI=y
CONFIG_ESP32LIBFUN_MCPWM=n
